Publ/Teoria/DataStruct/DataStructures.html
<!doctype html>
<html lang="en">
<head>
<title>Data Structures</title>
<!-- 2020-12-27 Sun 12:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. What is a Data Structure? (DS)</a></li>
<li><a href="#sec-2">2. Why Data Structures?</a></li>
<li><a href="#sec-3">3. Abstact Data Type (ADT)</a></li>
<li><a href="#sec-4">4. Computational Complexity Anlalysis</a></li>
<li><a href="#sec-5">5. Big-O Notation</a>
<ul class="nav">
<li><a href="#sec-5-1">5.1. Niveles de complejidad</a></li>
<li><a href="#sec-5-2">5.2. Propiedades de Big-O</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Data Structures</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is a Data Structure? (DS)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Una manera de organizar datos para que puedan ser usados de manera
efectiva.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Why Data Structures?</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Son esenciales para crear algoritmos rápidos y eficientes.
</li>
<li>Ayudan a manejar y organizar datos.
</li>
<li>Hacen que el código se vea limpio y sea fácil de entender.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Abstact Data Type (ADT)</h2>
<div class="outline-text-2" id="text-3">
<p>
Son una abstracción de una estructura de datos que provee solo la
interfaz a la que una estructura de datos deberia de adherirse.
</p>

<p>
Esta no da ningún detalle especifico sobre como algo debería de ser
implementado.
</p>

<blockquote>
<p>
Si tuviera que llegar del punto A al punto B el ADT seria la tarea de
llegar de &ldquo;A a B&rdquo; y la estuctura de datos sería el medio para llegar
de &ldquo;A a B&rdquo;.
</p>
</blockquote>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Abstraction (ADT)</th>
<th scope="col" class="text-left">Implementation (DS)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">List</td>
<td class="text-left">Dynamic Array, Linked List</td>
</tr>

<tr>
<td class="text-left">Queue</td>
<td class="text-left">Linked List, Based Queue, Array based Queue, Stack based Queue</td>
</tr>

<tr>
<td class="text-left">Map</td>
<td class="text-left">Tree Map, Hash Map/Hash Table</td>
</tr>

<tr>
<td class="text-left">Vehicle</td>
<td class="text-left">Golf Cart, Bycycle, Smart Car</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Computational Complexity Anlalysis</h2>
<div class="outline-text-2" id="text-4">
<p>
Se trata de preguntarnos dos preguntas: * ¿Cuánto <b>tiempo</b> este
algoritmo tarda en terminar? * ¿Cuánto <b>espacio</b> necesita este algoritmo
para trabajar?
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Big-O Notation</h2>
<div class="outline-text-2" id="text-5">
<p>
Esta notación nos da un tope de la complejidad en el <b>peor</b> caso,
ayudando a cuantificar el rendimiento cuando el tamaño de la entrada de
datos se hace arbitrariamente grande.
</p>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Niveles de complejidad</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Siendo \(n\) el tamaño de la entrada, La complejidad va de la de menor a mayor.
</p>
<ol class="org-ol">
<li>Tiempo Constante: \(O(1)\).
</li>
<li>Tiempo Logarítmico: \(O(log(n))\).
</li>
<li>Tiempo Linear: \(O(n)\).
</li>
<li>Tiempo Linearitmic: \(O(n*log(n)\).
</li>
<li>Tiempo Cuadrado: \(O(n^2)\).
</li>
<li>Tiempo Cúbico: \(O(n^3)\).
</li>
<li>Tiempo Exponencial: \(O(b^n),b>1\).
</li>
<li>Tiempo Factorial: \(O(n!)\).
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Propiedades de Big-O</h3>
<div class="outline-text-3" id="text-5-2">
\begin{aligned}
    O(n+c)&= \mathbf{O(n)} \\
    O(cn)&= \mathbf{O(n)}, c>0
\end{aligned}

<p>
Sea f una función que describe el tiempo de ejecución de un algoritmo
para una entrada de tamaño \(n\):
</p>

\begin{aligned}
  f(n) &= 7log(n)^3 + 15n^2 + 2n^3 + 8 \\
  O(f(n)) &= \mathbf{O(n^3)}
\end{aligned}
</div>

<div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Ejemplos Big-O</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ol class="org-ol"><li><a id="sec-5-2-1-1" name="sec-5-2-1-1"></a>Tiempo Constante<br ><div class="outline-text-5" id="text-5-2-1-1">
<p>
El siguiente ejemplo corre en tiempo <i>constante</i>: \(0(1)\)
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">a</span> := <span style="color: #B48EAD; font-weight: bold;">1</span>      
  b := <span style="color: #B48EAD; font-weight: bold;">1</span>      
  c := a + <span style="color: #B48EAD; font-weight: bold;">5</span>*b    
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">i</span> := <span style="color: #B48EAD; font-weight: bold;">0</span>
  While i &lt; <span style="color: #81A1C1; font-style: italic;">do</span>
  i = <span style="color: #B48EAD; font-weight: bold;">1</span>+<span style="color: #B48EAD; font-weight: bold;">1</span> 
</pre>
</div>
</div>
</li>

<li><a id="sec-5-2-1-2" name="sec-5-2-1-2"></a>Tiempo Lineal<br ><div class="outline-text-5" id="text-5-2-1-2">
<p>
Los siguientes ejemplos corren en tiempo <i>lineal</i>: \(\mathbf{O(n)}\)
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">i</span> := <span style="color: #B48EAD; font-weight: bold;">0</span>
  While i &lt; <span style="color: #8FBCBB;">n</span> Do
      i = i + <span style="color: #B48EAD; font-weight: bold;">1</span>
</pre>
</div>

<p>
Expresado matemáticamente
</p>

\begin{aligned}
    f(n) &= n \\
    O(f(n)) &= \mathbf{O(n)}
\end{aligned}

<blockquote>
<p>
Siendo \(n\) el valor mayor posible llegaremos en \(n\) iteraciones.
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">i</span> := <span style="color: #B48EAD; font-weight: bold;">0</span>
  While i &lt; <span style="color: #8FBCBB;">n</span> Do
      i = i + <span style="color: #B48EAD; font-weight: bold;">3</span>
</pre>
</div>

<p>
Expresado matemáticamente
</p>

\begin{aligned}
    f(n) &= n/3     \\
    O(f(n)) &= \mathbf{O(n)}
\end{aligned}

<blockquote>
<p>
Siendo \(n\) el valor mayor posible llegaremos a \(n\) en una tercera
parte de las iteraciones del ejemplo anterior.
</p>
</blockquote>
</div>
</li>

<li><a id="sec-5-2-1-3" name="sec-5-2-1-3"></a>Tiempo Cuadrático<br ><div class="outline-text-5" id="text-5-2-1-3">
<p>
Ambos de los siguientes ejemplos corren en tiempo cuadrático.
</p>

<p>
El primero puede que sea ovbio desde que \(n\) trabajos hechos en \(n\)
tiempos es \(n*n = \mathbf{O(n^2)}\) Pero el segundo..
</p>

<div class="org-src-container">

<pre class="src src-java">  For <span style="color: #81A1C1;">(</span>i := <span style="color: #B48EAD; font-weight: bold;">0</span> ; i &lt; <span style="color: #8FBCBB;">n</span>; i = i + <span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #81A1C1;">)</span>
      For <span style="color: #81A1C1;">(</span>j := <span style="color: #B48EAD; font-weight: bold;">0</span> ; j &lt; <span style="color: #8FBCBB;">n</span>; j = j + <span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #81A1C1;">)</span>
</pre>
</div>

<pre class="example">
  f(n) = n* n = n^2, O(f(n)) = \mathbf{O(n^2)}
</pre>

<div class="org-src-container">

<pre class="src src-java">  For <span style="color: #81A1C1;">(</span>i := <span style="color: #B48EAD; font-weight: bold;">0</span> ; i &lt; <span style="color: #8FBCBB;">n</span> ; i = i + <span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #81A1C1;">)</span>
      For <span style="color: #81A1C1;">(</span>j := i ; j &lt; <span style="color: #8FBCBB;">n</span> ; j = j = <span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #81A1C1;">)</span> 
</pre>
</div>

<p>
En el segundo For. <code>i</code> toma valores desde \(`[0,n)`\) la cantidad de
ciclos que hace es directamente determinada por que valor <code>i</code> es.
</p>

<blockquote>
<p>
Si <code>i=0</code> hace \(`n`\) iteraciones, si <code>i=1</code> hacemos \(`n-1`\) iteraciones,
si hacemos <code>i=2</code>, hacemos \(`n-2`\) iteraciones, etc&#x2026;
</p>
</blockquote>

<p>
Esto se convierte en \(n + (n-1) + (n-2) + (n-3) + \dots + 3 + 2 + 1\)
Esta serie se convierte en: \(n(n-1)/2\) así que.
</p>

\begin{displaymath}
    O(n(n+1)/2) = O(n^2/2 + n/2) = \mathbf{O(n²)}
\end{displaymath}
</div>
</li>

<li><a id="sec-5-2-1-4" name="sec-5-2-1-4"></a>Tiempo Logarítmico<br ><div class="outline-text-5" id="text-5-2-1-4">
<p>
Supongamos que tenemos un array ordenado y queremos encontrar el índice
de un valor particular, Si este existe.
</p>

<p>
¿Cuál es la complejidad en el tiempo del sigiente algoritmo?
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">low</span> := <span style="color: #B48EAD; font-weight: bold;">0</span> 
  high := n-<span style="color: #B48EAD; font-weight: bold;">1</span> 
  While low &lt;= high Do
      mid := <span style="color: #81A1C1;">(</span>low + high<span style="color: #81A1C1;">)</span> / <span style="color: #B48EAD; font-weight: bold;">2</span>

      If array<span style="color: #81A1C1;">[</span>mid<span style="color: #81A1C1;">]</span> == value: <span style="color: #81A1C1; font-style: italic;">return</span> mid
      Else If array<span style="color: #81A1C1;">[</span>mid<span style="color: #81A1C1;">]</span> &lt; value: lo = mid + <span style="color: #B48EAD; font-weight: bold;">1</span>
      Else If array<span style="color: #81A1C1;">[</span>mid<span style="color: #81A1C1;">]</span> &gt; value: hi = mid - <span style="color: #B48EAD; font-weight: bold;">1</span>

  <span style="color: #81A1C1; font-style: italic;">return</span> -<span style="color: #B48EAD; font-weight: bold;">1</span> <span style="color: #6f7787; font-style: italic;">//</span><span style="color: #6f7787; font-style: italic;">value not found</span>
</pre>
</div>

<blockquote>
<p>
<b>Respuesta:</b> \(O(log_2(n)) = \mathbf{log(n))}\).
</p>
</blockquote>
</div>
</li>


<li><a id="sec-5-2-1-5" name="sec-5-2-1-5"></a>Otros ejemplos<br ><div class="outline-text-5" id="text-5-2-1-5">
<p>
¿Cuál es la complejidad en el tiempo del sigiente algoritmo?
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">i</span> := <span style="color: #B48EAD; font-weight: bold;">0</span>
  While i &lt; <span style="color: #8FBCBB;">n</span> Do
      j = <span style="color: #B48EAD; font-weight: bold;">0</span>
      While j &lt; <span style="color: #B48EAD; font-weight: bold;">3</span>*n Do
          j = j + <span style="color: #B48EAD; font-weight: bold;">1</span>
      j = <span style="color: #B48EAD; font-weight: bold;">0</span> 
      While j &lt; <span style="color: #B48EAD; font-weight: bold;">2</span> * n Do
          j = j + <span style="color: #B48EAD; font-weight: bold;">1</span>
      i = i + <span style="color: #B48EAD; font-weight: bold;">1</span>
</pre>
</div>

<p>
Representado matemáticamente
</p>

\begin{aligned}
    f(n) &= n \cdot (3n + 2n) = 5n^2 \\
    O(f(n)) &= \mathbf{O(n^2)}
\end{aligned}

<p>
¿Cuál es la complejidad en el tiempo del sigiente algoritmo?
</p>

<div class="org-src-container">

<pre class="src src-java">  <span style="color: #81A1C1;">i</span> := <span style="color: #B48EAD; font-weight: bold;">0</span>
  While i &lt; <span style="color: #B48EAD; font-weight: bold;">3</span> * n Do
      j := <span style="color: #B48EAD; font-weight: bold;">10</span>
      While j &lt;= <span style="color: #B48EAD; font-weight: bold;">40</span> Do
          j = j + <span style="color: #B48EAD; font-weight: bold;">1</span>
      j = <span style="color: #B48EAD; font-weight: bold;">0</span>
      While j &lt; <span style="color: #8FBCBB;">n</span>*n*n Do
          j = j + <span style="color: #B48EAD; font-weight: bold;">2</span>
      i = i + <span style="color: #B48EAD; font-weight: bold;">1</span>
</pre>
</div>

\begin{aligned}
    f(n) &= 3n \cdot (40 + n^3 / 2) = 3n/40 + 3n^4/2 \\
    O(f(n)) &= \mathbf{O(n^4)}
\end{aligned}
</div>
</li></ol>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2020-12-27 Sun 12:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.5)</p>
</div>
</footer>
</body>
</html>
